---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationAncillaryType
source: html/3f331b67-b918-5d8d-7fad-7313614c6e5e.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationAncillaryType

An enumerated type listing all fabrication ancillary types.

## Syntax (C#)
```csharp
public enum FabricationAncillaryType
```